fabricio-godoi/u4cQueue/uNET/radio/cc2520/cc2520_old.c
	return 0;
}



/*---------------------------------------------------------------------------*/
///* TODO move to specific file
#define asmv(arg) __asm__ __volatile__(arg)
int splhigh_(void) {
	int sr;
	/* Clear the GIE (General Interrupt Enable) flag. */
#ifdef __IAR_SYSTEMS_ICC__
	sr = __get_SR_register();
	__bic_SR_register(GIE);
#else
	asmv("mov r2, %0" : "=r" (sr));
	asmv("bic %0, r2" : : "i" (GIE));
#endif
	__no_operation(); // must be set after updating GIE /// Fabricio
	return sr & GIE; /* Ignore other sr bits. */
}
#define splhigh() splhigh_()
/// Set Processor Level
#define splx(sr) __asm__ __volatile__("bis %0, r2" : : "r" (sr))
////*******
/**
 * \brief Init transceiver
 *
 *        This routine initializes the radio transceiver
 */
int cc2520_init(const void *isr_handler) {

//	const addr64_t mac_addr64 = { .u8 = { PANID_INIT_VALUE, 0x00, 0x00, 0x00,
//			0x00, MAC16_INIT_VALUE } };
	//uint16_t shortaddr;
	//uint16_t panid;

	_isr_handler = isr_handler;

	CC2520_SPI_PORT_INIT();

//	int s = splhigh();

	/* all input by default, set these as output */
	CC2520_CSN_PORT(DIR) |= BV(CC2520_CSN_PIN);
	CC2520_VREG_PORT(DIR) |= BV(CC2520_VREG_PIN);
	CC2520_RESET_PORT(DIR) |= BV(CC2520_RESET_PIN);

	/* force input pins */
	CC2520_FIFOP_PORT(DIR) &= ~(BV(CC2520_FIFOP_PIN));
	CC2520_FIFO_PORT(DIR) &= ~(BV(CC2520_FIFO_PIN));
	CC2520_CCA_PORT(DIR) &= ~(BV(CC2520_CCA_PIN));
	CC2520_SFD_PORT(DIR) &= ~(BV(CC2520_SFD_PIN));

	CC2520_SPI_DISABLE(); /* Unselect radio. */

	// Configure interruption event (rising edge)
	CC2520_DISABLE_FIFOP_INT();
	CC2520_FIFOP_INT_INIT();
	//	splx(s);

	// Configure interruption event (falling edge)
//	CC2520_DISABLE_SFD_INT();
//	CC2520_SFD_INT_INIT();

	/* Set the IO pins direction */
//	CC2520_PIN_INIT();  above (BRTOS portion)

	SET_VREG_INACTIVE();
	clock_delay(250);
	/* Turn on voltage regulator and reset. */
	SET_VREG_ACTIVE();
	clock_delay(250);
	SET_RESET_ACTIVE();
	clock_delay(127);
	SET_RESET_INACTIVE();
	clock_delay(125);
	/* Turn on the crystal oscillator. */
	strobe(CC2520_INS_SXOSCON);
	clock_delay(125);

	BUSYWAIT_UNTIL(status() & (BV(CC2520_XOSC16M_STABLE)), RTIMER_SECOND / 100);

	/* Change default values as recommended in the data sheet, */
	/* correlation threshold = 20, RX bandpass filter = 1.3uA.*/

	setreg(CC2520_TXCTRL, 0x94);
	setreg(CC2520_TXPOWER, 0x13);    // Output power 1 dBm

	/*
	 valeurs de TXPOWER
	 0x03 -> -18 dBm
	 0x2C -> -7 dBm
	 0x88 -> -4 dBm
	 0x81 -> -2 dBm
	 0x32 -> 0 dBm
	 0x13 -> 1 dBm
	 0x32 -> 0 dBm
	 0x13 -> 1 dBm
	 0xAB -> 2 dBm
	 0xF2 -> 3 dBm
	 0xF7 -> 5 dBm
	 */
	setreg(CC2520_CCACTRL0, 0xF8);  // CCA treshold -80dBm

	// Recommended RX settings
	setreg(CC2520_MDMCTRL0, 0x84);  // Controls modem
	setreg(CC2520_MDMCTRL1, 0x14);  // Controls modem
	setreg(CC2520_RXCTRL, 0x3F); // Adjust currents in RX related analog modules
	setreg(CC2520_FSCTRL, 0x5A);  // Adjust currents in synthesizer.
	setreg(CC2520_FSCAL1, 0x2B);  // Adjust currents in VCO
	setreg(CC2520_AGCCTRL1, 0x11);  // Adjust target value for AGC control loop
	setreg(CC2520_AGCCTRL2, 0xEB);

	//  Disable external clock
	setreg(CC2520_EXTCLOCK, 0x00);

	//  Tune ADC performance
	setreg(CC2520_ADCTEST0, 0x10);
	setreg(CC2520_ADCTEST1, 0x0E);
	setreg(CC2520_ADCTEST2, 0x03);


	/* Set auto CRC on frame. */
#if CC2520_CONF_AUTOACK
	setreg(CC2520_FRMCTRL0, CC2520_AUTOCRC | CC2520_AUTOACK);
	setreg(CC2520_FRMFILT0, FRAME_MAX_VERSION|FRAME_FILTER_ENABLE); // accept all frames and filter it (ACK, etc)
	// minimum frame length is 3
#else
	/* setreg(CC2520_FRMCTRL0,    0x60); */
	setreg(CC2520_FRMCTRL0, CC2520_AUTOCRC);
	/* Disable filter on @ (remove if you want to address specific wismote) */
	setreg(CC2520_FRMFILT0, 0x00);
#endif /* CC2520_CONF_AUTOACK */

	/* SET_RXENMASK_ON_TX */
	setreg(CC2520_FRMCTRL1, 1);
	/* Set FIFOP threshold to maximum .*/
	setreg(CC2520_FIFOPCTRL, FIFOP_THR(0x7F));

#if BRTOS_ENDIAN == BIG_ENDIAN
	// Big endian
	uint8_t mac_16[2] = {MAC16_INIT_VALUE};
	uint8_t pan_16[2] = {PANID_INIT_VALUE};
	uint16_t mac_id = mac_16[0]<<8+mac_16[1];
	uint16_t pan_id = pan_16[0]<<8+pan_16[1];
#else
	// Little endian
	uint8_t mac_16[2] = {MAC16_INIT_VALUE};
	uint8_t pan_16[2] = {PANID_INIT_VALUE};
	uint16_t mac_id = (mac_16[1]<<8)+mac_16[0];
	uint16_t pan_id = (pan_16[1]<<8)+pan_16[0];
#endif
	cc2520_set_pan_addr(pan_id,mac_id,NULL);
	cc2520_set_channel(CHANNEL_INIT_VALUE);

	// Flush all data
	flushrx();
	flushtx();

	// Enable radio in reception mode
    strobe(CC2520_INS_SRXON);
	BUSYWAIT_UNTIL(status() & (BV(CC2520_XOSC16M_STABLE)), RTIMER_SECOND / 100);
	CC2520_INTERRUPT_ENABLE_SET();

	return 0;
}
/*---------------------------------------------------------------------------*/
int cc2520_prepare(const void *data, unsigned short len) {
	uint8_t total_len;
	total_len = len + FOOTER_LEN;


	CC2520_PRINTF("cc2520: sending %d bytes\n", len);

	/* Write packet to TX FIFO. */
	flushtx();

	CC2520_WRITE_FIFO_BUF(&total_len, 1);
	CC2520_WRITE_FIFO_BUF(data, len);

	return 0;
}
/*---------------------------------------------------------------------------*/
int cc2520_transmit(void) {
//	uint8_t state;
	int i;

	/* The TX FIFO can only hold one packet. Make sure to not overrun
	 * FIFO by waiting for transmission to start here and synchronizing
	 * with the CC2520_TX_ACTIVE check in cc2520_send.
	 *
	 * Note that we may have to wait up to 320 us (20 symbols) before
	 * transmission starts.
	 */
#ifndef CC2520_CONF_SYMBOL_LOOP_COUNT
#error CC2520_CONF_SYMBOL_LOOP_COUNT needs to be set!!!
#else
#define LOOP_20_SYMBOLS CC2520_CONF_SYMBOL_LOOP_COUNT
#endif

	// CC2520 12 symbols is 192us
	//	320 / 20 = 16us per symbol - 12 symbols = 192us

	// Start transmitting
#if WITH_SEND_CCA
	strobe(CC2520_INS_SRXON); // TX is aborted by SRXON, STXON, SROFF
	BUSYWAIT_UNTIL(status() & BV(CC2520_RSSI_VALID), RTIMER_SECOND / 10);
	strobe(CC2520_INS_STXONCCA); // Start transmission
#else /* WITH_SEND_CCA */
	strobe(CC2520_INS_STXON);
#endif /* WITH_SEND_CCA */

