fabricio-godoi/u4cQueue/uNET/radio/cc2520/cc2520_old.c
	/// Check if transmission occur without errors
	for (i = LOOP_20_SYMBOLS; i > 0; i--) {
		// Transmission started
		if (CC2520_SFD_IS_1) {


			if (!(status() & BV(CC2520_TX_ACTIVE))) {
				/* SFD went high but we are not transmitting. This means that
				 we just started receiving a packet, so we drop the transmission. */
				// Return the radio to RX
				CC2520_PRINTF("cc2520: TX Collision on send\n");
				NODESTAT_UPDATE(radiocol);
				UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_COLLISION); // RADIO_TX_WAIT
				UNET_RADIO.set(TX_RETRIES, 0);
//				printf("TX Col 1\n");
				return RADIO_TX_ERR_COLLISION;
			}

			/* We wait until transmission has ended so that we get an
			 accurate measurement of the transmission time.*/
			BUSYWAIT_UNTIL(!(status() & BV(CC2520_TX_ACTIVE)), RTIMER_SECOND / 10);

			/**
			 * 	When AUTOACK is enabled, all frames that are
			 *	accepted by address filtering, have the acknowledge request flag
			 *	set and have a valid CRC, are automatically acknowledged 12
			 *	symbol periods after being received.
			 */

			// Check if ACK message return is needed
			NODESTAT_UPDATE(radiotx);
			if (is_radio_tx_ack(cc2520_radio_params.param[RADIO_STATE])){ // will need to wait ack
				// TX sent, but no acked
				UNET_RADIO.set(TX_STATUS, RADIO_TX_WAIT);
//				radio_tx_acked(FALSE);
				CC2520_PRINTF("cc2520: TX WAIT\n"); // waiting ack
				return RADIO_TX_WAIT;
			} else {
				// Broadcast message, no ack needed
//				radio_tx_acked(TRUE);
				UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_NONE);
				UNET_RADIO.set(TX_RETRIES, 0);
				CC2520_PRINTF("cc2520: TX OK\n");
				return RADIO_TX_ERR_NONE;
			}

			// Radio started TXing
//			UNET_RADIO.set(TX_STATUS, RADIO_TX_WAIT);
//			is_cc2520_txing = TRUE;

			// Wait end of transmission, signed in the SFD interruption
//			return RADIO_TX_WAIT;

			return 0; //RADIO_TX_OK;
		}
	}

//	printf("TX Col 2\n");

	/* If we are using WITH_SEND_CCA, we get here if the packet wasn't
	 transmitted because of other channel activity. */
	// Return the radio to RX
	NODESTAT_UPDATE(radiocol);
	CC2520_PRINTF("cc2520: TX Collision, transmission never start\n");
	UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_COLLISION); // RADIO_TX_WAIT
	UNET_RADIO.set(TX_RETRIES, 0);
	return RADIO_TX_ERR_COLLISION;
}

/*---------------------------------------------------------------------------*/
int cc2520_write(const void *buf, uint16_t len) {
	int ret = -1;

	// Error in packet size
	if (((len + FOOTER_LEN) <= 0) || ((len + FOOTER_LEN) > 127)) {
		return -1;
	}

	// If we get here, the controller isn't txing,
	// so flush the data on the radio tx buffer to
	// ensure that has no garbage there.
//	flushtx();
//	if((status() & BV(CC2520_TX_ACTIVE))){
//		cc2520_rx_enable(); // abort TX
//		printf("cc2520: tx still running\n");
////		return -1;
//	}

	uint8_t *frame_control = (uint8_t *) buf;
	CC2520_PRINTF("cc2520: write: ");
	CC2520_PRINTF_PACKET(frame_control, len);
	/// Check with the IEEE frame control if ACK is needed
	/// NOTE maybe should be in unet_core
	if (frame_control[0] == 0x41) {
		CC2520_PRINTF("cc2520: ACK NOT needed!\n");
		radio_tx_ack(FALSE);
		radio_tx_acked(TRUE);
	}
	if (frame_control[0] == 0x61) {
		CC2520_PRINTF("cc2520: ACK needed!\n");
		radio_tx_ack(TRUE);
		radio_tx_acked(FALSE);
	}
//	radio_txing(TRUE);

	// Put the packet in the radio
	cc2520_prepare(buf, len);

	ret = cc2520_transmit();

//	CC2520_INTERRUPT_ENABLE_CLR();
//		if((ret = cc2520_transmit()) != RADIO_TX_WAIT) _isr_handler();
//	if((ret = cc2520_transmit()) == RADIO_TX_ERR_COLLISION){
//		NODESTAT_UPDATE(radiocol);
//		UNET_RADIO.set(TX_STATUS, RADIO_TX_ERR_COLLISION); // RADIO_TX_WAIT
//		UNET_RADIO.set(TX_RETRIES, 0);
//		radio_txing(TRUE); // set this to true, to isr handler be able to release the lock
//		is_cc2520_txing = FALSE;
//		_isr_handler();
//	}
//	CC2520_INTERRUPT_ENABLE_SET();

	return ret;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Get message
 *
 *        This routine is used to retrieve a message stored in the RX_FIFO
 */
int32_t cc2520_get_rxfifo(uint8_t *buf, uint16_t buf_len) {
	volatile uint8_t len;
	uint8_t footer[2];

	CC2520_INTERRUPT_ENABLE_CLR();

	/* Disable packet reception */
	cc2520_rx_disable();

	// This will never happen in this OS, since the only
	// way to reach here is by FIFOP interruption
	if (!CC2520_FIFOP_IS_1) {
		printf("cc2520: fifop err\n");
		return 0;
	}

	CC2520_READ_FIFO_BYTE(len);
	if (len > FOOTER_LEN && len < buf_len) { // not shorter, neither longer

		CC2520_READ_FIFO_BUF(buf, len - FOOTER_LEN);
		CC2520_READ_FIFO_BUF(footer, FOOTER_LEN);
		len = len - FOOTER_LEN;

		/// Print PKT
		CC2520_PRINTF("cc2520: pkt: ");
		CC2520_PRINTF_PACKET(buf,len);
		CC2520_PRINTF("cc2520: rssi&lqi: ");
		CC2520_PRINTF_PACKET(footer,FOOTER_LEN);

		/**
		 * APPEND_DATA_MODE:
		 * When AUTOCRC = 0:Don’t care
		 * When AUTOCRC = 1:
		 * 0: RSSI + The crc_ok bit and the 7 bit correlation value is
		 * appended at the end of each received frame
		 * 1: RSSI + The crc_ok bit and the 7 bit SRCRESINDEX is
		 * appended at the end of each received frame. See Table 15 for
		 * details.
		 */
		cc2520_radio_params.st_radio_param.crc = (footer[1] & FOOTER1_CRC_OK) >> 7; // get the CRC bit
		cc2520_radio_params.st_radio_param.last_rssi = buf[0];
		cc2520_radio_params.st_radio_param.last_lqi = buf[1] & FOOTER1_CORRELATION;

	} else {
		len = len - FOOTER_LEN;
		printf("cc2520: len %d\n",len);
		flushrx();
		len = 0;
	}

	if (CC2520_FIFOP_IS_1) {
		if (!CC2520_FIFO_IS_1) {
			/* Clean up in case of FIFO overflow!  This happens for every
			 * full length frame and is signaled by FIFOP = 1 and FIFO =
			 * 0. */
			flushrx();
		}
	}

	/* Enable packet reception */
	NODESTAT_UPDATE(radiorx);
	cc2520_rx_enable();
	CC2520_INTERRUPT_ENABLE_SET();

	return len;
}
/*---------------------------------------------------------------------------*/
int cc2520_read(const void *buf, uint16_t *len) {
	*len = cc2520_get_rxfifo((uint8_t *) buf, 128);
	return 0;
}


